Horldsence/LaoLink/Common/Common/LogicAnalyzer/ch32h417_logic.c
/********************************** (C) COPYRIGHT  *******************************
 * File Name          : ch32h417_logic.c
 * Author             : Q2H2
 * Version            : V1.0.0
 * Date               : 2026/05/18
 * Description        : Core logic analyzer firmware functions for CH32H417, 
 *                      including clock configuration and HSADC handling.
 ********************************************************************************/
#include <string.h>
#include "ch32h417_logic.h"
#include "ch32h417_it.h"
#include "ch32h417_uhsif.h"
#include "ch32h417_usb.h"
#include "ch32h417_usbss_device.h"
#include "usb_desc.h"
#include "la_delay.h"

/* The logic analyzer runs on the V5F core only (same as the reference design).
 * Build the body of this file only for the V5F project; the shared Common
 * folder is also compiled by the V3F project. */
#ifdef Core_V5F

uint8_t adc_flag = 0;
volatile uint16_t test_flag = 0;
volatile uint32_t Flash_Erase_Page_Size = Size_8KB;
LOGIC_ADC_PARA logic_adc_info;
__attribute__((aligned(32))) uint16_t ADC_BufA[ADC_BUF_LEN + 1024];    // HADC double buffer 1
__attribute__((aligned(32))) uint16_t ADC_BufB[ADC_BUF_LEN + 1024];    // HADC double buffer 2

void HSADC_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));

/*********************************************************************
 * @fn      UHSIF_Clock_Set
 *
 * @brief   Initializes Logic sys PLL & sys CLK.
 * @param   rcc_pll  See Bit definition for RCC_PLLCFGR register
 * @return  none
 */
void UHSIF_Clock_Set(uint32_t rcc_pll)
{
    RCC->CFGR0 = (RCC->CFGR0 & ~RCC_SW) | RCC_SW_HSI;
    while((RCC->CFGR0 & RCC_SWS) != RCC_SWS_HSI);    // Wait for clock to stabilize

    RCC->PLLCFGR &= ~0x80000000;
    RCC->CTLR &= ~RCC_PLLON;

    RCC->PLLCFGR &= (uint32_t)((uint32_t)~(RCC_PLLMUL));
    RCC->PLLCFGR |= (uint32_t)rcc_pll;
    RCC->PLLCFGR &= (uint32_t)((uint32_t)~(RCC_PLL_SRC_DIV));
    RCC->PLLCFGR |= (uint32_t)RCC_PLL_SRC_DIV1;
    RCC->PLLCFGR &= (uint32_t)((uint32_t)~(RCC_PLLSRC));
    RCC->PLLCFGR |= (uint32_t)RCC_PLLSRC_HSE;

    RCC->CTLR |= RCC_PLLON;
    while((RCC->CTLR & RCC_PLLRDY) == 0);
    RCC->PLLCFGR |= 0x80000000;

    RCC->CFGR0 = (RCC->CFGR0 & ~RCC_SW) | RCC_SW_PLL;    // Switch to PLL clock, wait for clock to stabilize
    while((RCC->CFGR0 & RCC_SWS) != RCC_SWS_PLL);
    SystemAndCoreClockUpdate();
    USART_Printf_Init(921600);    // Reinit baud rate
    LA_Delay_Ms(100);                // Need delay time
}

/*********************************************************************
 * @fn      Set_Logic_Para_Fun
 *
 * @brief   Initializes Logic sys collection.
 *
 * @return  none
 */
void Set_Logic_Para_Fun(uint8_t logic_bit, uint8_t logic_sys)
{
    uint8_t uhsif_div;
    uint32_t rcc_pll;
    switch(logic_sys)
    {
    case 0x00:    // 200M  400/2
        rcc_pll = RCC_PLLMUL16;
        uhsif_div = RCC_UHSIFDIV_DIV2;
        break;
    case 0x01:    // 187M 25*15/2 =187.5
        rcc_pll = RCC_PLLMUL15;
        uhsif_div = RCC_UHSIFDIV_DIV2;
        break;
    case 0x02:    // 175  25*14/2 = 175
        rcc_pll = RCC_PLLMUL14;
        uhsif_div = RCC_UHSIFDIV_DIV2;
        break;
    case 0x03:    // 162M 25*13/2 = 162.5
        rcc_pll = RCC_PLLMUL13;
        uhsif_div = RCC_UHSIFDIV_DIV2;
        break;
    case 0x04:    // 156M  25*12.5/2 = 156.25
        rcc_pll = RCC_PLLMUL12_5;
        uhsif_div = RCC_UHSIFDIV_DIV2;
        break;
    case 0x05:    // 25*12/2 = 150
        rcc_pll = RCC_PLLMUL12;
        uhsif_div = RCC_UHSIFDIV_DIV2;
        break;
    case 0x06:    // 25*11/2 = 137.5
        rcc_pll = RCC_PLLMUL11;
        uhsif_div = RCC_UHSIFDIV_DIV2;
        break;
    case 0x07:    // 25*10/2 = 125
        rcc_pll = RCC_PLLMUL10;
        uhsif_div = RCC_UHSIFDIV_DIV2;
        break;
    case 0x08:    // 25*9/2 = 112.5
        rcc_pll = RCC_PLLMUL9;
        uhsif_div = RCC_UHSIFDIV_DIV2;
        break;
    case 0x09:    // 100
        rcc_pll = RCC_PLLMUL16;
        uhsif_div = RCC_UHSIFDIV_DIV4;
        break;
    case 0x0a:    // 187.5 /2 =
        rcc_pll = RCC_PLLMUL15;
        uhsif_div = RCC_UHSIFDIV_DIV4;
        break;
    case 0x0b:    // 25*14/2 = 175/2 = 87.5
        rcc_pll = RCC_PLLMUL14;
        uhsif_div = RCC_UHSIFDIV_DIV4;
        break;
    case 0x0c:    // 162.5/2 = 81.5
        rcc_pll = RCC_PLLMUL13;
        uhsif_div = RCC_UHSIFDIV_DIV4;
        break;
    case 0x0d:    // 156.25/2 = 78.125
        rcc_pll = RCC_PLLMUL12_5;
        uhsif_div = RCC_UHSIFDIV_DIV4;
        break;
    case 0x0e:    // 150/2 = 75
        rcc_pll = RCC_PLLMUL12;
        uhsif_div = RCC_UHSIFDIV_DIV4;
        break;
    case 0x0f:    // 137.5/2 = 68.75
        rcc_pll = RCC_PLLMUL11;
        uhsif_div = RCC_UHSIFDIV_DIV4;
        break;
    default:    // Default 100M
        rcc_pll = RCC_PLLMUL16;
        uhsif_div = RCC_UHSIFDIV_DIV4;
        break;
    }
    logic_adc_info.uhsif_div = uhsif_div;
    if(logic_adc_info.usb_status == USB_U2_CONNECT)
    {    // USB2.0 high speed, reconfigure buffer descriptor
        if(logic_bit == 8)
        {
            rcc_pll = RCC_PLLMUL16;                 // Default 400M
            uhsif_div = RCC_UHSIFDIV_DIV10;         // 10x divider, speed 40MB
        }
        else if(logic_bit == 16)
        {
            rcc_pll = RCC_PLLMUL16;                 // Default 400M
            uhsif_div = RCC_UHSIFDIV_DIV20;         // 20x divider, speed 20MB
        }
        logic_adc_info.uhsif_div = uhsif_div;
        UHSIF_Clock_Set(rcc_pll);                   // Configure system PLL clock
        UHSIF_Set_Para(logic_bit, uhsif_div);       // Configure parallel acquisition parameters
    }
    else
    {                                               // USB3.0 super speed
        UHSIF_Clock_Set(rcc_pll);                   // Configure system PLL clock
        UHSIF_Set_Para(logic_bit, uhsif_div);       // Configure parallel acquisition parameters
    }
}

/*********************************************************************
 * @fn      Dac_Init
 *
 * @brief   Initializes dac collection.
 *
 * @return  none
 */
void Dac_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStructure = { 0 };
    DAC_InitTypeDef DAC_InitType = { 0 };

    RCC_HB2PeriphClockCmd(RCC_HB2Periph_GPIOA, ENABLE);
    RCC_HB1PeriphClockCmd(RCC_HB1Periph_DAC, ENABLE);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

