Horldsence/LaoLink/Common/Common/LogicAnalyzer/ch32h417_logic.c
    TIM_TimeBaseInitStructure.TIM_Period = arr;
    TIM_TimeBaseInitStructure.TIM_Prescaler = psc;
    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 10;
    TIM_TimeBaseInit( TIM1, &TIM_TimeBaseInitStructure);

    TIM_ClearITPendingBit( TIM1, TIM_IT_Update );

	NVIC_SetPriority(TIM1_UP_IRQn,0);
	NVIC_EnableIRQ(TIM1_UP_IRQn);

    TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);
    TIM_Cmd( TIM1, ENABLE );
}


/*********************************************************************
 * @fn      TIM1_UP_IRQHandler
 *
 * @brief   This function handles TIM1 UP exception.
 *
 *
 * @return  none
 */
void TIM1_UP_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void TIM1_UP_IRQHandler(void)
{
    if(TIM_GetITStatus(TIM1, TIM_IT_Update)==SET)
    {
        if( logic_adc_info.usb_trans_flag ){
            logic_adc_info.usb_trans_count++;
            if( logic_adc_info.usb_trans_count &0x01 ){
                USB_LINK_OFF( );
            }
            else{
                USB_LINK_ON( );
            }
        }
    }
    TIM_ClearITPendingBit( TIM1, TIM_IT_Update );
}


/*********************************************************************
 * @fn      Led_Time_Init
 *
 * @brief   This function  TIM1 Init.
 *
 *
 * @return  none
 */
void Led_Time_Init( void )
{
    TIM1_INT_Init( 10000, 400 );
    TIM_Cmd( TIM1, ENABLE );
}
#endif /* Core_V5F */
